cases/OpenFOAM/lagrangian/reactingParcelFoam/filter/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 400;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 350;
    }

    outlet
    {
        type            zeroGradient;
    }

    cycLeft_half0
    {
        type            cyclic;
    }

    cycRight_half0
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }

    cycLeft_half1
    {
        type            cyclic;
    }

    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
